ir_version: 11
producer_name: "mobius"
producer_version: "0.1.0"
graph {
  node {
    input: "model.embed_tokens.weight"
    input: "input_ids"
    output: "v_model.embed_tokens.Gather_0"
    name: "model/embed_tokens/Gather_node_0"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/embed_tokens: Embedding"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Embedding\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'embed_tokens\']"
    }
  }
  node {
    input: "position_ids"
    output: "v_model.rotary_emb.Shape_1"
    name: "model/rotary_emb/Shape_node_1"
    op_type: "Shape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Shape_1"
    input: "const_1d_0"
    input: "const_1d_1"
    input: "const_1d_2"
    output: "v_model.rotary_emb.Slice_2"
    name: "model/rotary_emb/Slice_node_2"
    op_type: "Slice"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    output: "v_model.rotary_emb.Constant_3"
    name: "model/rotary_emb/Constant_node_3"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 3
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Constant_3"
    input: "v_model.rotary_emb.Slice_2"
    output: "v_model.rotary_emb.Concat_4"
    name: "model/rotary_emb/Concat_node_4"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "position_ids"
    input: "const_1d_2"
    output: "v_model.rotary_emb.Unsqueeze_5"
    name: "model/rotary_emb/Unsqueeze_node_5"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Unsqueeze_5"
    input: "v_model.rotary_emb.Concat_4"
    output: "v_model.rotary_emb.Expand_6"
    name: "model/rotary_emb/Expand_node_6"
    op_type: "Expand"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Expand_6"
    input: "v_model.rotary_emb.Concat_4"
    output: "v_model.rotary_emb.Reshape_7"
    name: "model/rotary_emb/Reshape_node_7"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Reshape_7"
    input: "const_1d_2"
    output: "v_model.rotary_emb.Gather_8"
    name: "model/rotary_emb/Gather_node_8"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Gather_8"
    input: "const_1d_2"
    output: "v_model.rotary_emb.Squeeze_9"
    name: "model/rotary_emb/Squeeze_node_9"
    op_type: "Squeeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.cos_cache"
    input: "v_model.rotary_emb.Squeeze_9"
    output: "v_model.rotary_emb.Gather_10"
    name: "model/rotary_emb/Gather_node_10"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.sin_cache"
    input: "v_model.rotary_emb.Squeeze_9"
    output: "v_model.rotary_emb.Gather_11"
    name: "model/rotary_emb/Gather_node_11"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Reshape_7"
    input: "const_1d_3"
    output: "v_model.rotary_emb.Gather_12"
    name: "model/rotary_emb/Gather_node_12"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Gather_12"
    input: "const_1d_2"
    output: "v_model.rotary_emb.Squeeze_13"
    name: "model/rotary_emb/Squeeze_node_13"
    op_type: "Squeeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.cos_cache"
    input: "v_model.rotary_emb.Squeeze_13"
    output: "v_model.rotary_emb.Gather_14"
    name: "model/rotary_emb/Gather_node_14"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.sin_cache"
    input: "v_model.rotary_emb.Squeeze_13"
    output: "v_model.rotary_emb.Gather_15"
    name: "model/rotary_emb/Gather_node_15"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Reshape_7"
    input: "const_1d_4"
    output: "v_model.rotary_emb.Gather_16"
    name: "model/rotary_emb/Gather_node_16"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "v_model.rotary_emb.Gather_16"
    input: "const_1d_2"
    output: "v_model.rotary_emb.Squeeze_17"
    name: "model/rotary_emb/Squeeze_node_17"
    op_type: "Squeeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.cos_cache"
    input: "v_model.rotary_emb.Squeeze_17"
    output: "v_model.rotary_emb.Gather_18"
    name: "model/rotary_emb/Gather_node_18"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.sin_cache"
    input: "v_model.rotary_emb.Squeeze_17"
    output: "v_model.rotary_emb.Gather_19"
    name: "model/rotary_emb/Gather_node_19"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.h_mask"
    input: "v_model.rotary_emb.Gather_14"
    input: "v_model.rotary_emb.Gather_10"
    output: "v_model.rotary_emb.Where_20"
    name: "model/rotary_emb/Where_node_20"
    op_type: "Where"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.w_mask"
    input: "v_model.rotary_emb.Gather_18"
    input: "v_model.rotary_emb.Where_20"
    output: "v_model.rotary_emb.Where_21"
    name: "model/rotary_emb/Where_node_21"
    op_type: "Where"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.h_mask"
    input: "v_model.rotary_emb.Gather_15"
    input: "v_model.rotary_emb.Gather_11"
    output: "v_model.rotary_emb.Where_22"
    name: "model/rotary_emb/Where_node_22"
    op_type: "Where"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "model.rotary_emb.w_mask"
    input: "v_model.rotary_emb.Gather_19"
    input: "v_model.rotary_emb.Where_22"
    output: "v_model.rotary_emb.Where_23"
    name: "model/rotary_emb/Where_node_23"
    op_type: "Where"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/rotary_emb: InterleavedMRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'InterleavedMRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'rotary_emb\']"
    }
  }
  node {
    input: "attention_mask"
    input: "const_1_i64"
    output: "v_model.CumSum_24"
    name: "model/CumSum_node_24"
    op_type: "CumSum"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.CumSum_24"
    input: "const_1d_3"
    output: "v_model.Unsqueeze_25"
    name: "model/Unsqueeze_node_25"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "input_ids"
    output: "v_model.Shape_26"
    name: "model/Shape_node_26"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "attention_mask"
    output: "v_model.Shape_27"
    name: "model/Shape_node_27"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Shape_27"
    input: "v_model.Shape_26"
    output: "v_model.Sub_28"
    name: "model/Sub_node_28"
    op_type: "Sub"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.CumSum_24"
    input: "v_model.Sub_28"
    input: "v_model.Shape_27"
    input: "const_1d_6"
    output: "v_model.Slice_29"
    name: "model/Slice_node_29"
    op_type: "Slice"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Slice_29"
    input: "const_1d_4"
    output: "v_model.Unsqueeze_30"
    name: "model/Unsqueeze_node_30"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Unsqueeze_30"
    input: "v_model.Unsqueeze_25"
    output: "v_model.GreaterOrEqual_31"
    name: "model/GreaterOrEqual_node_31"
    op_type: "GreaterOrEqual"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "attention_mask"
    input: "const_1d_3"
    output: "v_model.Unsqueeze_32"
    name: "model/Unsqueeze_node_32"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Unsqueeze_32"
    output: "v_model.Cast_33"
    name: "model/Cast_node_33"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Cast_33"
    input: "v_model.GreaterOrEqual_31"
    output: "v_model.And_34"
    name: "model/And_node_34"
    op_type: "And"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.And_34"
    input: "const_0.0_f32"
    input: "const_-65504.0_f32"
    output: "v_model.Where_35"
    name: "model/Where_node_35"
    op_type: "Where"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Where_35"
    output: "v_model.Cast_36"
    name: "model/Cast_node_36"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 10
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "v_model.Cast_36"
    input: "const_1d_3"
    output: "v_model.Unsqueeze_37"
    name: "model/Unsqueeze_node_37"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\']"
    }
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    input: "const_1.0_f16"
    output: "v_model.layers.0.input_layernorm.Add_38"
    name: "model/layers.0/input_layernorm/Add_node_38"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/input_layernorm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'input_layernorm\']"
    }
  }
  node {
    input: "v_model.embed_tokens.Gather_0"
    input: "v_model.layers.0.input_layernorm.Add_38"
    output: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    name: "model/layers.0/input_layernorm/RMSNormalization_node_39"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/input_layernorm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'input_layernorm\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    output: "v_model.layers.0.linear_attn.Shape_40"
    name: "model/layers.0/linear_attn/Shape_node_40"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 1
      type: INT
    }
    attribute {
      name: "start"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    input: "model.layers.0.linear_attn.in_proj_qkv.weight"
    output: "v_model.layers.0.linear_attn.in_proj_qkv.Transpose_41"
    name: "model/layers.0/linear_attn/in_proj_qkv/Transpose_node_41"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_qkv: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_qkv\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    input: "v_model.layers.0.linear_attn.in_proj_qkv.Transpose_41"
    output: "v_model.layers.0.linear_attn.in_proj_qkv.MatMul_42"
    name: "model/layers.0/linear_attn/in_proj_qkv/MatMul_node_42"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_qkv: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_qkv\']"
    }
  }
  node {
    input: "model.layers.0.linear_attn.in_proj_z.weight"
    output: "v_model.layers.0.linear_attn.in_proj_z.Transpose_43"
    name: "model/layers.0/linear_attn/in_proj_z/Transpose_node_43"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_z: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_z\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    input: "v_model.layers.0.linear_attn.in_proj_z.Transpose_43"
    output: "v_model.layers.0.linear_attn.in_proj_z.MatMul_44"
    name: "model/layers.0/linear_attn/in_proj_z/MatMul_node_44"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_z: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_z\']"
    }
  }
  node {
    input: "model.layers.0.linear_attn.in_proj_b.weight"
    output: "v_model.layers.0.linear_attn.in_proj_b.Transpose_45"
    name: "model/layers.0/linear_attn/in_proj_b/Transpose_node_45"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_b: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_b\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    input: "v_model.layers.0.linear_attn.in_proj_b.Transpose_45"
    output: "v_model.layers.0.linear_attn.in_proj_b.MatMul_46"
    name: "model/layers.0/linear_attn/in_proj_b/MatMul_node_46"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_b: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_b\']"
    }
  }
  node {
    input: "model.layers.0.linear_attn.in_proj_a.weight"
    output: "v_model.layers.0.linear_attn.in_proj_a.Transpose_47"
    name: "model/layers.0/linear_attn/in_proj_a/Transpose_node_47"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_a: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_a\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    input: "v_model.layers.0.linear_attn.in_proj_a.Transpose_47"
    output: "v_model.layers.0.linear_attn.in_proj_a.MatMul_48"
    name: "model/layers.0/linear_attn/in_proj_a/MatMul_node_48"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/in_proj_a: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'in_proj_a\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.in_proj_qkv.MatMul_42"
    output: "v_model.layers.0.linear_attn.Transpose_49"
    name: "model/layers.0/linear_attn/Transpose_node_49"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    output: "v_model.layers.0.linear_attn.conv1d.Constant_50"
    name: "model/layers.0/linear_attn/conv1d/Constant_node_50"
    op_type: "Constant"
    attribute {
      name: "value_float"
      f: 0.0
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/conv1d: _DepthwiseConv1d"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'_DepthwiseConv1d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'conv1d\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.conv1d.Constant_50"
    input: "model.layers.0.linear_attn.conv1d.weight"
    output: "v_model.layers.0.linear_attn.conv1d.CastLike_51"
    name: "model/layers.0/linear_attn/conv1d/CastLike_node_51"
    op_type: "CastLike"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/conv1d: _DepthwiseConv1d"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'_DepthwiseConv1d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'conv1d\']"
    }
  }
  node {
    output: "v_model.layers.0.linear_attn.conv1d.Constant_52"
    name: "model/layers.0/linear_attn/conv1d/Constant_node_52"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 6144
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/conv1d: _DepthwiseConv1d"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'_DepthwiseConv1d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'conv1d\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.conv1d.CastLike_51"
    input: "v_model.layers.0.linear_attn.conv1d.Constant_52"
    output: "v_model.layers.0.linear_attn.conv1d.Expand_53"
    name: "model/layers.0/linear_attn/conv1d/Expand_node_53"
    op_type: "Expand"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/conv1d: _DepthwiseConv1d"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'_DepthwiseConv1d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'conv1d\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Transpose_49"
    input: "model.layers.0.linear_attn.conv1d.weight"
    input: "v_model.layers.0.linear_attn.conv1d.Expand_53"
    input: "past_key_values.0.conv_state"
    output: "v_model.layers.0.linear_attn.conv1d.CausalConv1DWithState_54_0"
    output: "present.0.conv_state"
    name: "model/layers.0/linear_attn/conv1d/CausalConv1DWithState_node_54"
    op_type: "CausalConv1DWithState"
    attribute {
      name: "activation"
      s: "silu"
      type: STRING
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet/conv1d: _DepthwiseConv1d"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\', \'_DepthwiseConv1d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\', \'conv1d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "No schema registered for \'CausalConv1DWithState\' version \'24\' and domain \'com.microsoft\'!"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.conv1d.CausalConv1DWithState_54_0"
    output: "v_model.layers.0.linear_attn.Transpose_55"
    name: "model/layers.0/linear_attn/Transpose_node_55"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.conv1d.CausalConv1DWithState_54_0 of node model/layers.0/linear_attn/Transpose_node_55 not known"
    }
  }
  node {
    output: "v_model.layers.0.linear_attn.Constant_56"
    name: "model/layers.0/linear_attn/Constant_node_56"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 2048
      ints: 2048
      ints: 2048
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Transpose_55"
    input: "v_model.layers.0.linear_attn.Constant_56"
    output: "v_model.layers.0.linear_attn.Split_57_0"
    output: "v_model.layers.0.linear_attn.Split_57_1"
    output: "v_model.layers.0.linear_attn.Split_57_2"
    name: "model/layers.0/linear_attn/Split_node_57"
    op_type: "Split"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.Transpose_55 of node model/layers.0/linear_attn/Split_node_57 not known"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_39"
    output: "v_model.layers.0.linear_attn.Shape_58"
    name: "model/layers.0/linear_attn/Shape_node_58"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    output: "v_model.layers.0.linear_attn.Constant_59"
    name: "model/layers.0/linear_attn/Constant_node_59"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 16
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    output: "v_model.layers.0.linear_attn.Constant_60"
    name: "model/layers.0/linear_attn/Constant_node_60"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 128
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Shape_40"
    input: "v_model.layers.0.linear_attn.Shape_58"
    input: "v_model.layers.0.linear_attn.Constant_59"
    input: "v_model.layers.0.linear_attn.Constant_60"
    output: "v_model.layers.0.linear_attn.Concat_61"
    name: "model/layers.0/linear_attn/Concat_node_61"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Split_57_0"
    input: "v_model.layers.0.linear_attn.Concat_61"
    output: "v_model.layers.0.linear_attn.Reshape_62"
    name: "model/layers.0/linear_attn/Reshape_node_62"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.Split_57_0 of node model/layers.0/linear_attn/Reshape_node_62 not known"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Split_57_1"
    input: "v_model.layers.0.linear_attn.Concat_61"
    output: "v_model.layers.0.linear_attn.Reshape_63"
    name: "model/layers.0/linear_attn/Reshape_node_63"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.Split_57_1 of node model/layers.0/linear_attn/Reshape_node_63 not known"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Split_57_2"
    input: "v_model.layers.0.linear_attn.Concat_61"
    output: "v_model.layers.0.linear_attn.Reshape_67"
    name: "model/layers.0/linear_attn/Reshape_node_67"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.Split_57_2 of node model/layers.0/linear_attn/Reshape_node_67 not known"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.in_proj_z.MatMul_44"
    input: "v_model.layers.0.linear_attn.Concat_61"
    output: "v_model.layers.0.linear_attn.Reshape_68"
    name: "model/layers.0/linear_attn/Reshape_node_68"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Reshape_62"
    input: "v_model.layers.0.linear_attn.Reshape_62"
    output: "v_model.layers.0.linear_attn.Mul_69"
    name: "model/layers.0/linear_attn/Mul_node_69"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.Reshape_62 of node model/layers.0/linear_attn/Mul_node_69 not known"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Mul_69"
    input: "const_1d_10"
    output: "v_model.layers.0.linear_attn.ReduceSum_70"
    name: "model/layers.0/linear_attn/ReduceSum_node_70"
    op_type: "ReduceSum"
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 0 value v_model.layers.0.linear_attn.Mul_69 of node model/layers.0/linear_attn/ReduceSum_node_70 not known"
    }
  }
  node {
    output: "v_model.layers.0.linear_attn.Constant_71"
    name: "model/layers.0/linear_attn/Constant_node_71"
    op_type: "Constant"
    attribute {
      name: "value_float"
      f: 1e-06
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.Constant_71"
    input: "v_model.layers.0.linear_attn.Reshape_62"
    output: "v_model.layers.0.linear_attn.CastLike_72"
    name: "model/layers.0/linear_attn/CastLike_node_72"
    op_type: "CastLike"
    metadata_props {
      key: "namespace"
      value: ": Qwen35CausalLMModel/model: Qwen35TextModel/layers.0: Qwen35DecoderLayer/linear_attn: GatedDeltaNet"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35CausalLMModel\', \'Qwen35TextModel\', \'Qwen35DecoderLayer\', \'GatedDeltaNet\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'linear_attn\']"
    }
    metadata_props {
      key: "pkg.onnxscript.shape_inference_error"
      value: "Type of input 1 value v_model.layers.0.linear_attn.Reshape_62 of node model/layers.0/linear_attn/CastLike_node_72 not known"
    }
  }
  node {
    input: "v_model.layers.0.linear_attn.ReduceSum_70"
    input: "v_model.layers.0.linear_attn.CastLike_72"
    output: "v_model.layers.0.linear_attn.Add_73"
